# 3) კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.


# არგუმენტი არის ის მნიშვნელობა რაც გადაეცემა ფუნქციას

# არსებობს ორი სახის ფუნქციები: რომლებისთვისაც სავალდებულოა არგუმენტი და რომლისთვისაც არა

# ფუნქციები Python-ში გამოყენების მრავალი ხერხი ვიცით:
# input() - მომხმარებელს შემოაქვს ნებისმიერი სახის ინფორმაცია
# range() - თვლის 0-დან მითითებულ რიცვხის ჩათვლით
# int() - გარდაქმით მონაცემის ტიპს integer-ად.
# str() - გარდაქმით მონაცემის ტიპს string-ად.
# float() - გარდაქმით მონაცემის ტიპს float-ად.
# bool() - განსაზღვრავს True-ს და False-ს
# print() - გამოაქვს ტერმინალში ინფორმაცია
# type() - განსაზღვრავს მონაცემის ტიპს