# 1) ჩამოწერეთ Set-ის ძირითადი განმასხვავებელი თვისებები.

# set -  სეთი ლისტისგან განსხვავებით მას:

# 1. ინდექსი არ გააჩნია
# 2. დაპრინტვისას მას შორდება დუპლიკატები
# 3. დაპრინტვისას მისი ელემენტები იცვლიან ადგილებს 
# 4. .add() - ფუნქციით ჩვენ შეგვიძლია დავამატოთ ელემენტები 
# 5. .remove() - ფუნქციით ჩვენ შეგვიძლია მოვაშოროთ ნებისმიერი ელემენტი
# 6. .clear() - შეგვიძლია გავასუფთავოთ მთლიანი სეთი
# 7. .union() - შეგვიძლია ორი სეთი გავაერთიანოდ
# 8. .difference() - აბრუნებს რა განსხვავებაა წერტილის იქით გადაცემულ სეთში რომელიც არ არის მეორე (ფრჩხილებში გადაცემული სეთში)

