# 2) თქვენი სიტყვებით ახსენით:
# • რას ეწოდება ფუნქცია?
# • რისთვის გამოიყენება ფუნქციები Python-ში.


# რას ეწოდება ფუნქცია?
# ფუნქცია არის მრავალჯერადი გამოყენების ბლოკი რომლის მიზანია რომელიმე კონკრეტული ოპერაციის შესრულება.

# რისთვის გამოიყენება ფუნქციები Python-ში.
# ფუნქციებს ვიყენებთ იმისთვის, რომ ყოველ ჯერზე რომ არ ვწეროთ ერთი და იგივე კოდუ და რომ მოკლედ და კონკრეტულად შევასრულოთ მოქმედებები


# ფუნქციები Python-ში გამოყენების მრავალი ხერხი ვიცით:
# input() - მომხმარებელს შემოაქვს ნებისმიერი სახის ინფორმაცია
# range() - თვლის 0-დან მითითებულ რიცვხის ჩათვლით
# int() - გარდაქმით მონაცემის ტიპს integer-ად.
# str() - გარდაქმით მონაცემის ტიპს string-ად.
# float() - გარდაქმით მონაცემის ტიპს float-ად.
# bool() - განსაზღვრავს True-ს და False-ს
# print() - გამოაქვს ტერმინალში ინფორმაცია
# type() - განსაზღვრავს მონაცემის ტიპს