# HARD LVL:
# 6) დაწერეთ ოთახის გაგრილების სისტემის პროგრამა, but there’s a twist:
# ჩათვალეთ, რომ პროგრამა მხოლოდ იმ შემთხვევაში აღიქვამს ოთახის ტემპერატურას, თუ იგი ფარენგეიტშია გადმოცემული. (სისტემა ჩაირთვება მაშინ, როდესაც ტემპერატურა 89.6 ფარენგეიტს ასცდება). 
# ერთადერთი გასათვალისწინებელი ფაქტი ის არის, რომ მომხმარებელს ოთახის ტემპერატურა გრადუსებში შემოაქვს. 
# ეცადეთ დაწეროთ პირობის მიხედვით ისეთი ოთახის გაგრილების სისტემის პროგრამა, რომელიც სწორად იმუშავებს



celsius = float(input("Enter your celsius number: "))

fahrenheit = float((celsius *( 9/5 )) + 32)


if fahrenheit > 89.6:
    print("turn on AC")