# 1) დაწერეთ თუ რა დანიშნულება აქვს if, elif და else-ს.

# if - იგივე "თუ"- ამ ფუნქციით მომხმარებელს ვუყენებთ წესებს რომლებსაც ჩვენ ვქმნით
# elif - ეს არის შეერთება else-ის და if-ის. იგი იწერება იმ შემთხვევაში როდესაც ჩვენს მიერ დაწესებულია მრავალი წესი
# else - იგივე "სხვა" - ეს ფუნქცია იწერება ყოველთვის ბოლოში რომელსაც არ სჭირდება ლოგიკური ოპერაცია და გამორიცხავს ზემოთ მყოფი if-ის და elif-ის პირობებს

# example:

age = int(input("Enter your age: "))


if age <= 0:
    print("შენ დაბადებული არ ხარ")
elif age > 6:
    print("შენ სკოლაში მიდიხარ!!")
elif age > 13 and  age < 18:
    print("შენ ხარ თინეიჯერი")
else:
    print("შენ ხარ ზრდასრული") 