// დაწერეთ რას გამოიტანს თითოეული კოდი. დეტალურად ახსენით კოდის გაშვების პროცესი


// hw3 - კოდის ახსნა

let sum = 0; // იქნება საწყისი ამთვლელი ცვლადი
for (let counter = 0; counter < 5; counter++)// იქმნება for ციკლი რომელიც გააგრძელებს მუშაობას სანამ counter ცვლადი ნაკლებია 5-ის, let counter = 0 -- ვქნით საწყის ჩვლად რომლის გარშემო იტრიალებს for ციკლი counter < 5 -- ამით წესს ვუდებთ რომ კოდი მანამ გაეშვება სანამ counter ცვლადი იქნება 5-ზე ნაკლები, ხოლო counter++ ჩვენ თითოეულ ინტერაციაზე მას ეკრამენტ ოპერატორით ვამატებთ ერთს
    { 
        sum += counter; // ყოველ ინტერაციაზე counter რიცხვი რასაც მიიღებს დაამატებს sum ცვლადში
        if (counter == 3){
            break; //  თუ counter ცვლადი გახდება Number მონაცემის ტიპის მნიშვნელიბით 3 კოდი break; -ის საშვალებით გაჩერდება და გადავა შემედეგ ნაბიჯზე
        }
}  

console.log(sum); // საბოლოოდ აბრუნებს sum ცვლადის მნიშვნელობას რომელიც არის 6
