# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.


num1 = 1872313 
num2 = 1929173

number1 =  (num1 + num2)    # მიმატება
number2 =  (num1 - num2)    # გამოკლება
number3 =  (num1 * num2)    # გამრავლება
number4 = (num1 / num2)     # გაყოფა


print(number1)
print(number2)
print(number3)
print(number4)