# 6) მოიძიეთ პითონზე ინფორმაცია: რომელ წელს შეიქმნა, ვინ შექმნა, ძირითადად რისთვის ვიყენებთ ამ ენას პროგრამირების სფეროში და ა.შ. მოძიებული ინფორმაცია ასევე ჩაწერეთ დავალებების ფოლდერშიც. (დამიჯერეთ ეს ინფორმაცია ძალიან გამოგადგებათ, მითუმეტეს უნდა იცოდეთ ინფორმაცია იმ ენის შესახებ, რომელსაც ამჟამად სწავლობთ).

# Look up some Informations about Python: What year was it created, who created it, In what aspect do we usually use Python in Programming and etc. (Trust me, it'll really help you out, besides you should have some basic knowledge about a programming language that you're currently learning)


# პითონი (Python) არის ერთ-ერთი ყველაზე პოპულარული და გავრცელებული პროგრამირების ენა თანამედროვე მსოფლიოში. ის 
# შეიქმნა 1991 წელს, ნიდერლანდელი პროგრამისტის, გიდო ვან როსუმის (Guido van Rossum) მიერ. პითონის შექმნის მიზანი იყო ისეთი ენის შექმნა, რომელიც იქნებოდა მარტივი წასაკითხი, გასაგები და ამავე დროს ძლიერი და მოქნილი.
# პითონის სახელი უკავშირდება არა გველს, როგორც ხშირად ფიქრობენ, არამედ ბრიტანულ იუმორისტულ შოუს – Monty Python's Flying Circus. სწორედ ამ შოუს სახელი შთააგონა ავტორს ენის დასახელებისას.პითონის ერთ-ერთი მთავარი უპირატესობა არის მისი მარტივი სინტაქსი, რომელიც წააგავს ბუნებრივ ენას და ამით კიდევ უფრო უადვილებს პროგრამისტებს კოდის წერა და გაგება.
# დღეს პითონი ითვლება უნივერსალურ ენად და მისი ცოდნა ძალზე მნიშვნელოვანია როგორც დამწყებთათვის, ასევე პროფესიონალი პროგრამისტებისთვის.