# 4) შექმენით ორი ცვლადი: Num1 და Num2. ორივე ცვლადში შინახეთ input-ი, სადაც მომხმარებელმა სასურველი რიცხვები უნდა შემოიტანოს. ამ ოპერაციის დასრულების შემდეგ სცადეთ რომ Num1-სა და Num2-ს შორის განახორციელოთ მათემატიკური ოპერაცია და დააკვირდით ტერმინალში შედეგს. ახსენით თქვენი აზრით რატომ მივიღეთ ასეთი შედეგი.

Num1 = int(input("Enter your number: "))
Num2 = int(input("Enter your number: "))


print(Num1 + Num2)
print(Num2 - Num1)
print(Num1 * Num2)
print(Num1 / Num2)

# ტერმინალში გამოტანილი შედეგი არის მომხმარებლის ბიერ შემოტანილი რიცხვისა
