# 2) ჩამოწერეთ პირობითი განცხადებების შემადგენელი ყველა Keyword-ი, თითოეულს თან დაურთეთ განმარტება და თქვენი სიტყვებით ახსენით თუ რატომ/რა შემთხვევებში არის elif keyword-ი საჭირო.

# if - იგივე "თუ"- ამ ფუნქციით მომხმარებელს ვუყენებთ წესებს რომლებსაც ჩვენ ვქმნით

# elif - ეს არის შეერთება else-ის და if-ის. იგი იწერება იმ შემთხვევაში როდესაც ჩვენს მიერ დაწესებულია მრავალი წესი და ამისთვის საჭიროა elif-ი

# else - იგივე "სხვა" - ეს ფუნქცია იწერება ყოველთვის ბოლოში რომელსაც არ სჭირდება ლოგიკური ოპერაცია და გამორიცხავს ზემოთ მყოფი if-ის და elif-ის პირობებს