# 4) დააკვირდით მოცემულ flowchart-ს, ახსენით მისი მუშაობის პრინციპი. მისი მიხედვით Vscode-ში დაწერეთ პროგრამა და აღწერეთ რა შედეგს გამოიტანს კოდი იმ შემთხვევაში, როდესაც მომხმარებელი არის 14 წლის და არ არის სტუდენტი


# ეს flowchart-მუშაობს იმ პრინციპით რომ, მომხმარებელს შემოატანინებს თავის ასაკს, თუ იგი არის 18 ნაკლები და არის სტუდენტი მასშინ ის მიიღებს 20% ფასდაკლებას, თუ არა მაშინ 10% ფასტაკლება. 
# თუ მომხმარებლის ასაკი მეტია 18-ზე მაშინ მომხმარებელი იხდის სრულ ფასს


age = int(input("Enter your age: "))
student = input("Are you a student?: ")

if age < 18 and student == "yes":
    print("discount 20%")

elif age < 18 and student == "no":
    print("discount 10%")
else:
    print("Regular price")
