# 1) დეტალურად განიხილეთ (კომენტარის სახით) და გაიაზრეთ მოცემული კოდი:

def func(a, b):
        a += 1
        b.append(1)
        return a, b

a = 5

b = []
print(func(a, b))
print(a, b)


# ჩვენ ვიცის რომ ცვლადებს ვერ შევცვლით და მათთვის სხვა მნიშვნელობის მიცემა მის საწყისს მნიშვნებოასთან ერთად არ შეგვიძლია, ხოლო სიებში ამის გაკეთება შევგვიძლია არა მარტო დავამატოთ არამედ ამოვშალოთ
# ამ ფუნქციის კოდში a არის ცვლადი, ხოლო b არის ლისტი. 
# როდესაც ჩვენ ვეუბნებით რომ a+=1 ამით ჩვენ რაღაცა მოქმედების შემდებ ვუმატებთ მას 1-ს. ხოლო b-ს სიაში ვამატებთ  ციფრ 1-ს, რაც იმას ნიშნავს რომ b არის ლისტი. 

# პირველი პრინტისას ჩვენ ვიძახებთ ფუნქციას სადაც ცვლადს გატოლებულიაქ ციფრი 5 და რადგან ვიცით რომ პითონში კოდის წამკითხველი ზემოდან ქვემოთ მოყვება a-ს დაუმადებს ერთს და b-s მნიშვნელობას გამოიტანს 1-ს ვინაირად b ლისტი იყო თავდაპირველად ცარიელი

# მეორე პრინტისას კი ჩვენ აღარ ვიძახებთ ფუნქცის ამიტომაც a-მნიშვნელობად გამოვა 5, ხოლო b-ს მნიშვნელიბად გამოვა 1