// გადაიტანეთ მოცემული კოდი VScode-ში და დეტალურად კომენტარის სახით ახსენით რა მოქმედება ხორციელოდება თითოეულ ხაზზე. (აღწერეთ რა და რატომ ხდება და დაწერეთ თუ საბოლოო შედეგი რა იქნება კონსოლში)


let arr = [0, 1, 2, 3, 4]; // შეიქმნა მასივი სახელად arr
let result = 0; // საწყისი ასათლელი ცვლადი 

for(let i = 0; i < arr.length; i++){ // გადავუარეთ arr მასივს for ლუპით სანამ მისი სიგრზის ნაკლებია 
    let val = arr[i]; // val-ში ჩაიწერა მასივის i-ური ელემენტის მნიშვნელობა

    if(val && val % 2 === 0){ // თუ მნიშვნელობა იყოფა ორზე უნაშთოდ მაშინ დაამატოს ეს მნიშნელობა result
        result += val
    } 
    else if (val || val === 0 ){ // თუ val არის truthy (1,2,3...) ან ზუსტად 0, მაშინ: val სწორია?  +1, თუარადა  +10
        result += val ? 1: 10
    }
    else{
        result += 100; // ეს არასდროს არ შესრულდება ვინაიდან ზემოთა პირობა უკვე ფარავს უველა პირობას 
    }
}


console.log(result)