# 3) კომენტარის სახით დაწერეთ, თუ რაში ვიყენებთ map და filter ფუნქციებს. მოიყვანეთ თითო მაგალითი.


# map() - ფუნქციის გამოყენების დროშ ჩვენ შეგვიძლია საინტერაციო ობიექტს გადავუაროთ და ჩავანაცვლოთ ელემენტი. მას გადაეცემა ორი არგუმენტი, პირველი არის ის პირობა რაზეც უნდა იმუშაოს და მეორე თავად ის ობიექტი რომელზეც უნდა აწარმოობს ეს  პირობა


C = [40, 50]
# F = ( C * 9/5) + 32

F = list(map(lambda c: (c * 9/5) + 32, C))
print(F)
# filter () - ფუნქციის დროს კი მხოლოდ მისი გაფილტვრა შეგვიძლია კონკრეტულ პირობაზე დაყრდნობით

nums = [173, 1983, -198, -198, 2888, -28]

only_negatives = list(filter(lambda n: n < 0, nums))

print(only_negatives)